Repository: lockywolf/kprof
Catalog: trunk/kprof-cvsbackup/kprof/po/*.po
Languages: de

source: _: NAME OF TRANSLATORS Your names
de: Namen der Übersetzer Andrey Behrens

source: _: EMAIL OF TRANSLATORS Your emails
de: Email-Adressen der Übersetzer Andrey.Behrens@gmx.de

source: Generate Call Graph
de: Erzeugung Aufrufs-Graph

source: Graph File Format
de: Graphen Dateiformat

source: Graph Tree Settings
de: Graphen-Baum Einstellungen

source: Selected Function And Called Functions
de: Ausgewählte und aufgerufene Funktionen

source: Whole Call Tree
de: Gesamter Aufrufsbaum

source: Action
de: Aktion

source: Run graphing application
de: Aufruf Zeichenapplikation

source: Display the call graph in the chosen application
de: Anzeigen des Aufrufgraphen in der gewählten Applikation

source: Save file
de: Datei speichern

source: Save the file to disk
de: Speichern der Datei auf der Festplatte

source: %d%% faster
de: %d%% schneller

source: %d%% slower
de: %d%% langsamer

source: deleted
de: gelöscht

source: Compare With...
de: Vergleichen mit ...

source: Abbreviate C++ &Templates
de: Anzeigen C++ &Templates

source: Select Font...
de: Schrift Auswahl...

source: &Generate Call Graph...
de: &Erzeugung Aufruf Graphen

source: &Display TreeMap View
de: &Anzeigen Baumstruktur-Ansicht

source: &Flat Profile
de: &Flaches Profil

source: &Hierarchical Profile
de: &Hierarchisches Profil

source: O&bject Profile
de: O&bjekt Profil

source: Type text in this field to filter the display and only show the functions/methods whose name match the text.
de: Nach Eingabe in diesem Feld werden nur die Funktionen angezeigt,/deren Namen zum eingegeben Text passen.

source: This is the <I>flat view</I>. It displays all functions and method 'flat'. Click on a column header to sort the list on this column (click a second time to reverse the sort order).
de: Diese ist die <I>flache Anzeige</I>. Alle Funktionen und Methoden werden "flach" angezeigt. Klicken Sie auf einen Spaltenkopf um die Anzeige zu sortieren (zweimal klicken: umgekehrte Sortierung)

source: This is the <I>hierarchical view</I>. It displays each function/method like a tree to let you see the other functions that it calls. For that reason, each function may appear several times in the list.
de: Dies ist die <I>hierarchische Anzeige</I>. Alle Funktionen/Methoden werden in einem Baum angezeigt, um anzuzeigen welche Funktion welche andere Funktion aufruft. Daher können Funktionen auch mehrfach aufgeführt werden.

source: This is the <I>object view</I>. It displays C++ methods grouped by object name.
de: Dies ist die <I>Objekt Anzeige</I>. C++ Methoden werden um den Objektname gruppiert.

source: Function/Method
de: Funktionen/Methoden

source: Remarks
de: Bemerkungen

source: Old Count
de: Alte Anzahl

source: New Count
de: Neue Anzahl

source: Old Total (s)
de: Alte Gesamt (s)

source: New Total (s)
de: Neue Gesamt (s)

source: Old %
de: Alt %s

source: New %
de: Neu %s

source: Old Self (s)
de: Altes Version (s)

source: New Self (s)
de: Neue Version (s)

source: Old Total ms/call
de: Alte Gesamt ms/Aufruf

source: New Total ms/call
de: Neue Gesamt ms/Aufruf

source: Count
de: Anzahl

source: Total (s)
de: Gesamt (s)

source: Self (s)
de: selbst

source: Total ms/call
de: Gesamt ms/Aufruf

source: Old Self ms/call
de: Altes Selbst ms/Aufruf

source: New Self ms/call
de: Neues Selbst ms/Aufruf

source: Self ms/call
de: Selbst ms/Aufruf

source: Old Min. ms/call
de: Alter Min ms/Aufruf

source: New Min. ms/call
de: Neue Min ms/Aufruf

source: Old Max. ms/call
de: Alter Max ms/Aufruf

source: New Max. ms/call
de: Neuer Max ms/Aufruf

source: Min. ms/call
de: Min ms/Aufruf

source: Max. ms/call
de: Max ms/Aufruf

source: Old Self Cycles
de: Alter Selbstkreis

source: New Self Cycles
de: Neuer Selbst Kreis

source: Old Total Cycles
de: Alte Gesamt Durchläufe

source: New Total Cycles
de: Neue Gesamtdurchläufe

source: Self Cycles
de: Eigene Gesamtdurchläufe

source: Total Cycles
de: Gesamtdurchläufe

source: Select a profiling results file to compare...
de: Wählen Sie eine Profiler Ergebnisdatei zum Vergleich

source: Select a profiling results file
de: Auswahl einer Profiler Ergebnis Datei

source: Text File Format:
de: Text Dateiformat

source: Can't find any profiling output file (gmon.out or fnccheck.out)
de: Kann keine Ausgabe-Datei des Profilers finden (gmon.out oder fnccheck.out)

source: File not found
de: Datei nicht gefunden

source: Could not generate the profile data.
de: Konnte keine Profil-Daten erzeugen.

source: Error %d was returned.
de: Fehler %d wurde zurückgegeben.

source: It returned the following error message(s):
de: Es gab folgende Fehlermeldungen zurück:

source: Following output was displayed:
de: Folgende Ausgabe wurde angezeigt:

source: gprof exited with error(s)
de: gprof mit Fehler(n) beendet

source: File 'gmon.out' is the result of the execution of an application with gprof(1) profiling turned on. You can not open it as such: either open the application itself or open a text results file generated with 'gprof -b application-name'
de: Die Datei "gmou.out" wird bei der Ausführung einer Applikation erzeugt, wenn beim compilieren dieser Applikation der GNU Profiler (gprof) Support eingeschalten wurde Sie können diese Datei nicht direkt öffnen. Öffnen Sie stattdessen die Applikation oder eine von gprof erzeugte Text Datei (mit "gprof -b Applikationsname")

source: Opening gmon.out not allowed
de: �Öffnen von gmou.out nicht erlaubt

source: File 'fnccheck.out' is the result of the execution of an application with Function Check profiling turned on. You can not open it as such: either open the application itself or open a text results file generated with 'fncdump +calls application-name'
de: Die Datei "fnccheck.out" wird bei der Ausführung einer Applikation mit eingeschaltetem Function Check Profiling Support angelegt. Sie können die Datei nicht direkt öffnen. Öffnen Sie statt dessen die Applikation selbst, oder eine Textdatei, welche mit dem Kommando "fncdump +calls-application-name" erzeugt wurde

source: Opening fnccheck.out not allowed
de: Öffnen von fnccheck.out ist nicht erlaubt

source: Invalid File
de: Defekte Datei

source: This file does not appear to be a valid Function Check output file. It should have been generated using the following command line: fncdump +calls -no-decoration {application_name}
de: Diese Datei scheint keine funktionierende Function Check Ausgabe Datei zu sein. Eine solche Datei wird mit dem folgenden Kommando erzeugt: fncdump +calls -no-decoration {application_name}

source: Called By:
de: Aufgerufen durch:

source: Calls:
de: Aufrufe:

source: To export the current selection's call-graph, you must select an item in the profile view.
de: Um den Aufruf-Grafik der aktuellen Auswahl zu exportieren, müssen Sie ein Item in der Profil-Ansicht auswählen.

source: Selection Empty
de: Leere Auswahl

source: *.dot|GraphViz files
de: *.dot|GraphViz Dateien

source: *.vcg|VCG files
de: .vcg|VCG Dateien

source: Save call-graph as...
de: Aufruf-Graph speichern unter...

source: File could not be opened for writing.
de: Datei konnte nicht zum schreiben geöffnet werden

source: File Error
de: Datei Fehler

source: Internal Error
de: Interner Fehler

source: Could not find any function or class to export.
de: Konnte keine Funktionen oder Klassen zum exportieren finden

source: Could not open a temporary file for writing.
de: Konnte temporäre Datei nicht zum schreiben öffnen.

source: Could not display the data.
de: Konnte Daten nicht anzeigen.

source: xvcg exited with error(s)
de: xvcg mit Fehler(n) beendet

source: KProf Object Profile
de: KProf Objekt Profil

source: KProf Hierarchy Profile
de: KProf Hierarchisches Profil

source: Execution profile results analysis utility
de: Ausführung des Profiler Tools zur Ergebnis-Analyse
